sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pm.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/espressif/esp_pm.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/power/pm.h>

#include <debug.h>

#include "include/esp_pm.h"
#include "espressif/esp_pm.h"
#include "esp_hr_timer.h"

#ifdef CONFIG_SCHED_TICKLESS
#  include "esp_tickless.h"
#endif
#include "esp_sleep.h"
#include "soc/rtc.h"
#include "esp_sleep_internal.h"
#include "esp_pmu.h"
#include "esp_attr.h"
#include "esp_private/pm_impl.h"

#ifdef CONFIG_PM_EXT1_WAKEUP
#  include "driver/rtc_io.h"
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP
#  include "driver/gpio.h"
#  include "espressif/esp_gpio.h"
#  include "hal/gpio_types.h"
#  include "soc/soc_caps.h"
#endif
#ifdef CONFIG_PM_UART_WAKEUP
#  include "driver/uart_wakeup.h"
#  include "hal/uart_types.h"
#  include "hal/uart_hal.h"
#  include "hal/uart_ll.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#if defined(CONFIG_ARCH_CHIP_ESP32C3) || \
    defined(CONFIG_ARCH_CHIP_ESP32C6)
#  define CHECK_VDD_SPI 1
#  if defined(CONFIG_ARCH_CHIP_ESP32C6)
/* GPIO20 - GPIO26 are powered by VDD_SPI Powered */
#    define CHECK_VDD_SPI_PIN_MASKS 133169152
#  else
/* GPIO19 - GPIO24 are powered by VDD_SPI Powered */
#    define CHECK_VDD_SPI_PIN_MASKS 33030144
#  endif /* CONFIG_ARCH_CHIP_ESP32C6 */
#endif /* CONFIG_ARCH_CHIP_ESP32C3_GENERIC || CONFIG_ARCH_CHIP_ESP32C6 */

#ifdef CONFIG_PM_EXT0_WAKEUP
#  define EXT0_WAIT_TIME_US 5000000
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP
#  define EXT1_WAIT_TIME_US 5000000
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP
#  define GPIO_WAIT_TIME_US 5000000
#endif
#ifdef CONFIG_PM_UART_WAKEUP
#  define UART_WAIT_TIME_US 5000000
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Wakeup reasons string. */

const char *g_wakeup_reasons[] =
{
  "undefined",
  "",
  "",
  "EXT1",
  "Timer",
  "",
  "ULP",
  "GPIO",
  "UART",
  "",
  "",
  "",
  "",
  "",
  ""
};

static esp_sleep_wakeup_cause_t g_last_wakeup_reason =
                                  ESP_SLEEP_WAKEUP_UNDEFINED;
static uint64_t g_last_wakeup_time = 0;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_PM_EXT0_WAKEUP
/****************************************************************************
 * Name: esp_pm_ext0_wakeup_prepare
 *
 * Description:
 *   Configure ext0 gpios to use as wakeup source.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR esp_pm_ext0_wakeup_prepare(void)
{
  int pin = CONFIG_PM_EXT0_WAKEUP_GPIO;
#  ifdef CONFIG_PM_EXT0_WAKEUP_TRIGGER_LOW
  int level_mode = 0;
#  else
  int level_mode = 1;
#  endif /* CONFIG_PM_EXT0_WAKEUP */
  esp_sleep_enable_ext0_wakeup(pin, level_mode);
}
#endif /* CONFIG_PM_EXT0_WAKEUP */

#ifdef CONFIG_PM_EXT1_WAKEUP
/****************************************************************************
 * Name: esp_pm_get_ext1_io_mask
 *
 * Description:
 *   Get ext1 IO mask value from configured wakeup pins.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   A 64-bit unsigned integer where each bit corresponds to an RTC GPIO pin
 *   that has been configured as an ext1 wakeup source.
 *
 ****************************************************************************/

static uint64_t IRAM_ATTR esp_pm_get_ext1_io_mask(void)
{
  uint64_t io_mask = 0;
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO0
  io_mask |= BIT(0);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO1
  io_mask |= BIT(1);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO2
  io_mask |= BIT(2);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO3
  io_mask |= BIT(3);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO4
  io_mask |= BIT(4);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO5
  io_mask |= BIT(5);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO6
  io_mask |= BIT(6);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO7
  io_mask |= BIT(7);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO8
  io_mask |= BIT(8);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO9
  io_mask |= BIT(9);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO10
  io_mask |= BIT(10);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO11
  io_mask |= BIT(11);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO12
  io_mask |= BIT(12);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO13
  io_mask |= BIT(13);
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP_RTC_GPIO14
  io_mask |= BIT(14);
#endif

  return io_mask;
}

/****************************************************************************
 * Name: esp_pm_ext1_wakeup_prepare
 *
 * Description:
 *   Configure ext1 gpios to use as wakeup source.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR esp_pm_ext1_wakeup_prepare(void)
{
  int pin_mask;
  uint64_t io_mask;
#  ifdef CONFIG_PM_EXT1_WAKEUP_TRIGGER_ANY_LOW
  esp_sleep_ext1_wakeup_mode_t level_mode = ESP_EXT1_WAKEUP_ANY_LOW;
#  else
  esp_sleep_ext1_wakeup_mode_t level_mode = ESP_EXT1_WAKEUP_ANY_HIGH;
#  endif /* CONFIG_PM_EXT1_WAKEUP */
  io_mask = esp_pm_get_ext1_io_mask();
  for (int i = 0; i < CONFIG_SOC_GPIO_PIN_COUNT; i++)
    {
      pin_mask = BIT(i);
      if ((io_mask & pin_mask) != 0)
        {
          esp_sleep_enable_ext1_wakeup_io(pin_mask, level_mode);
        }
    }

  esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_PERIPH, ESP_PD_OPTION_ON);
}
#endif /* CONFIG_PM_EXT1_WAKEUP */

