sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pm.c
#ifdef CONFIG_PM_GPIO_WAKEUP
/****************************************************************************
 * Name: esp_pm_get_gpio_mask
 *
 * Description:
 *   Get GPIO mask value from configured wakeup pins.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   A 64-bit unsigned integer where each bit corresponds to an GPIO pin
 *   that has been configured as an GPIO wakeup source.
 *
 ****************************************************************************/

static uint64_t IRAM_ATTR esp_pm_get_gpio_mask(void)
{
  uint64_t io_mask = 0;
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO0
  io_mask |= BIT64(0);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO1
  io_mask |= BIT64(1);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO2
  io_mask |= BIT64(2);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO3
  io_mask |= BIT64(3);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO4
  io_mask |= BIT64(4);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO5
  io_mask |= BIT64(5);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO6
  io_mask |= BIT64(6);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO7
  io_mask |= BIT64(7);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO8
  io_mask |= BIT64(8);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO9
  io_mask |= BIT64(9);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO10
  io_mask |= BIT64(10);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO11
  io_mask |= BIT64(11);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO12
  io_mask |= BIT64(12);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO13
  io_mask |= BIT64(13);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO14
  io_mask |= BIT64(14);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO15
  io_mask |= BIT64(15);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO16
  io_mask |= BIT64(16);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO17
  io_mask |= BIT64(17);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO18
  io_mask |= BIT64(18);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO19
  io_mask |= BIT64(19);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO20
  io_mask |= BIT64(20);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO21
  io_mask |= BIT64(21);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO22
  io_mask |= BIT64(22);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO23
  io_mask |= BIT64(23);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO24
  io_mask |= BIT64(24);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO25
  io_mask |= BIT64(25);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO26
  io_mask |= BIT64(26);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO27
  io_mask |= BIT64(27);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO28
  io_mask |= BIT64(28);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO29
  io_mask |= BIT64(29);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO30
  io_mask |= BIT64(30);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO31
  io_mask |= BIT64(31);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO32
  io_mask |= BIT64(32);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO33
  io_mask |= BIT64(33);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO34
  io_mask |= BIT64(34);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO35
  io_mask |= BIT64(35);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO36
  io_mask |= BIT64(36);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO37
  io_mask |= BIT64(37);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO38
  io_mask |= BIT64(38);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO39
  io_mask |= BIT64(39);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO40
  io_mask |= BIT64(40);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO41
  io_mask |= BIT64(41);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO42
  io_mask |= BIT64(42);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO43
  io_mask |= BIT64(43);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO44
  io_mask |= BIT64(44);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO45
  io_mask |= BIT64(45);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO46
  io_mask |= BIT64(46);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO47
  io_mask |= BIT64(47);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO48
  io_mask |= BIT64(48);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO49
  io_mask |= BIT64(49);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO50
  io_mask |= BIT64(50);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO51
  io_mask |= BIT64(51);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO52
  io_mask |= BIT64(52);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO53
  io_mask |= BIT64(53);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO54
  io_mask |= BIT64(54);
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP_GPIO55
  io_mask |= BIT64(55);
#endif

  return io_mask;
}

/****************************************************************************
 * Name: esp_pm_gpio_wakeup_prepare
 *
 * Description:
 *   Configure gpios to use as gpio wakeup source.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR esp_pm_gpio_wakeup_prepare(void)
{
  uint64_t mask_value = esp_pm_get_gpio_mask();
  uint64_t pin_mask = 0;
#  ifdef CONFIG_PM_GPIO_WAKEUP_TRIGGER_ANY_LOW
  gpio_int_type_t level_mode = GPIO_INTR_LOW_LEVEL;
#  else
  gpio_int_type_t level_mode = GPIO_INTR_HIGH_LEVEL;
#  endif /* CONFIG_PM_EXT1_WAKEUP */

  for (int i = 0; i < CONFIG_SOC_GPIO_PIN_COUNT; i++)
    {
      pin_mask = BIT64(i);
      if ((mask_value & pin_mask) != 0)
        {
          gpio_wakeup_enable(i, level_mode);
        }
    }

#ifdef CHECK_VDD_SPI
  if ((mask_value & CHECK_VDD_SPI_PIN_MASKS) != 0)
    {
      esp_sleep_pd_config(ESP_PD_DOMAIN_VDDSDIO, ESP_PD_OPTION_ON);
    }
#endif /* CHECK_VDD_SPI */

  esp_sleep_enable_gpio_wakeup();
}
#endif /* CONFIG_PM_GPIO_WAKEUP */

#ifdef CONFIG_PM_UART_WAKEUP
/****************************************************************************
 * Name: esp_pm_uart_wakeup_prepare
 *
 * Description:
 *   Configure UART wake-up mode
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR esp_pm_uart_wakeup_prepare(void)
{
#  if defined(CONFIG_PM_UART_WAKEUP_UART0)
  int uart_num = 0;
#  elif defined(CONFIG_PM_UART_WAKEUP_UART1)
  int uart_num = 1;
#  endif
  uart_wakeup_cfg_t wake_up_cfg =
    {
#ifdef CONFIG_PM_UART_WAKEUP_ACTIVE_EDGE_THRESHOLD_MODE
      .wakeup_mode = UART_WK_MODE_ACTIVE_THRESH,
      .rx_edge_threshold = CONFIG_PM_UART_WAKEUP_ACTIVE_EDGE_THRESHOLD
#endif
#ifdef CONFIG_PM_UART_WAKEUP_FIFO_THRESHOLD_MODE
      .wakeup_mode = UART_WK_MODE_FIFO_THRESH,
      .rx_fifo_threshold = CONFIG_PM_UART_WAKEUP_FIFO_THRESHOLD
#endif
#ifdef CONFIG_PM_UART_WAKEUP_START_BIT_MODE
      .wakeup_mode = UART_WK_MODE_START_BIT,
#endif
#ifdef CONFIG_PM_UART_WAKEUP_CHAR_SEQ_MODE
      .wakeup_mode = UART_WK_MODE_CHAR_SEQ,
      .wake_chars_seq = CONFIG_PM_UART_WAKEUP_CHAR_SEQ
#endif
    };

  esp_sleep_set_console_uart_handling_mode(ESP_SLEEP_ALWAYS_FLUSH_UART);
  uart_wakeup_setup(uart_num, &wake_up_cfg);
  esp_sleep_enable_uart_wakeup(uart_num);
}
#endif /* CONFIG_PM_UART_WAKEUP */

#ifdef CONFIG_ESPRESSIF_AUTO_SLEEP

/****************************************************************************
 * Name: esp_pm_skip_light_sleep
 *
 * Description:
 *   Callback for the power manager's "skip light sleep" hook. This function
 *   checks if the system should defer entering light sleep after waking up
 *   from any supported wakeup source (EXT0, EXT1, GPIO, UART). It compares
 *   the current time to the last wakeup time for each source. If the system
 *   is still within the configured guard window for any wakeup source, it
 *   returns true to skip light sleep and let peripheral activity finish. If
 *   the guard window has elapsed or there was no wakeup, it returns false
 *   and allows light sleep to proceed.
 *
 *   Placed in IRAM because it runs in timing-critical power management
 *   decision paths.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   true  - Skip light sleep (recent EXT0, EXT1, GPIO, or UART wakeup still
 *           within the configured guard window).
 *   false - Allow light sleep (no relevant wakeup or guard window elapsed).
 *
 ****************************************************************************/

