sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pm.c
static bool IRAM_ATTR esp_pm_skip_light_sleep(void)
{
  bool skip = false;
#if defined(CONFIG_PM_EXT0_WAKEUP) || \
    defined(CONFIG_PM_EXT1_WAKEUP) || \
    defined(CONFIG_PM_GPIO_WAKEUP) || \
    defined(CONFIG_PM_UART_WAKEUP)
  uint64_t current_time = esp_hr_timer_time_us();
#endif

#ifdef CONFIG_PM_EXT0_WAKEUP
  if (g_last_wakeup_reason == ESP_SLEEP_WAKEUP_EXT0 &&
      current_time < (g_last_wakeup_time + EXT0_WAIT_TIME_US))
    {
      pwrinfo("EXT0 wakeup still within guard window\n");
      skip = true;
    }
#endif

#ifdef CONFIG_PM_EXT1_WAKEUP
  if (g_last_wakeup_reason == ESP_SLEEP_WAKEUP_EXT1 &&
      current_time < (g_last_wakeup_time + EXT1_WAIT_TIME_US))
    {
      pwrinfo("EXT1 wakeup still within guard window\n");
      skip = true;
    }
#endif

#ifdef CONFIG_PM_GPIO_WAKEUP
  if (g_last_wakeup_reason == ESP_SLEEP_WAKEUP_GPIO &&
      current_time < (g_last_wakeup_time + GPIO_WAIT_TIME_US))
    {
      pwrinfo("GPIO wakeup still within guard window\n");
      skip = true;
    }
#endif

#ifdef CONFIG_PM_UART_WAKEUP
  if (g_last_wakeup_reason == ESP_SLEEP_WAKEUP_UART &&
      current_time < (g_last_wakeup_time + UART_WAIT_TIME_US))
    {
      pwrinfo("UART wakeup still within guard window\n");
      skip = true;
    }
#endif

  return skip;
}

/****************************************************************************
 * Name: esp_pm_light_sleep_exit_cb
 *
 * Description:
 *   Store wakeup reason and timestamp on light sleep exit.
 *
 * Input Parameters:
 *   sleep_time_us - Actual sleep time in microseconds (unused).
 *   arg           - User callback argument (unused).
 *
 * Returned Value:
 *   ESP_OK
 *
 ****************************************************************************/

static esp_err_t IRAM_ATTR esp_pm_light_sleep_exit_cb(int64_t sleep_time_us,
                                                      void *arg)
{
  esp_sleep_wakeup_cause_t wc;
  uint64_t tw;

  UNUSED(sleep_time_us);
  UNUSED(arg);

  wc = esp_sleep_get_wakeup_cause();
  tw = esp_hr_timer_time_us();

  pwrinfo("Light sleep exit: %s, time: %lld\n", g_wakeup_reasons[wc], tw);

  esp_pm_wakeup_set_last_reason((int32_t)wc);
  esp_pm_wakeup_set_last_time(tw);

  return ESP_OK;
}
#endif /* CONFIG_ESPRESSIF_AUTO_SLEEP */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_pm_wakeup_set_last_reason
 *
 * Description:
 *   Store the sleep exit wakeup cause after light sleep.
 *
 * Input Parameters:
 *   reason - Value from esp_sleep_get_wakeup_cause().
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp_pm_wakeup_set_last_reason(int32_t reason)
{
  g_last_wakeup_reason = reason;
}

/****************************************************************************
 * Name: esp_pm_wakeup_set_last_time
 *
 * Description:
 *   Store the high-resolution timestamp (microseconds) for the last light
 *   sleep exit, together with the cause from
 *   esp_pm_wakeup_set_last_reason().
 *
 * Input Parameters:
 *   time_us - Time from esp_hr_timer_time_us() at exit from light sleep.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp_pm_wakeup_set_last_time(uint64_t time_us)
{
  g_last_wakeup_time = time_us;
}

/****************************************************************************
 * Name: esp_pm_sleep_enable_timer_wakeup
 *
 * Description:
 *   Configure wakeup interval
 *
 * Input Parameters:
 *   time_in_us - Sleep duration in microseconds.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp_pm_sleep_enable_timer_wakeup(uint64_t time_in_us)
{
  esp_sleep_enable_timer_wakeup(time_in_us);
}

/****************************************************************************
 * Name: esp_pm_light_sleep_start
 *
 * Description:
 *   Enter light sleep mode
 *
 * Input Parameters:
 *   sleep_time - Reference of uint64_t value to return actual sleep duration
 *                in microseconds. Use NULL if not needed.
 *
 * Returned Value:
 *   OK on success or a negated errno value if fails.
 *
 ****************************************************************************/

int esp_pm_light_sleep_start(uint64_t *sleep_time)
{
  int ret = OK;
  int sleep_start = rtc_time_get();
  int sleep_return = 0;

  ret = esp_light_sleep_start();
  if (sleep_time != NULL)
    {
      sleep_return = rtc_time_get();
      *sleep_time = sleep_return - sleep_start;
    }

  return ret;
}

/****************************************************************************
 * Name:  esp_pm_deep_sleep_start
 *
 * Description:
 *   Enter deep sleep mode
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp_pm_deep_sleep_start(void)
{
  esp_deep_sleep_start();

  /* Because RTC is in a slower clock domain than the CPU, it
   * can take several CPU cycles for the sleep mode to start.
   */

  while (1);
}

/****************************************************************************
 * Name: esp_pmstandby
 *
 * Description:
 *   Enter pm standby (light sleep) mode.
 *
 * Input Parameters:
 *   time_in_us - The maximum time to sleep in microseconds.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp_pmstandby(uint64_t time_in_us)
{
  uint64_t rtc_diff_us;
  esp_sleep_wakeup_cause_t cause;
#ifdef CONFIG_PM_GPIO_WAKEUP
  int64_t gpio_mask;
#endif
#ifdef CONFIG_PM_EXT0_WAKEUP
  esp_pm_ext0_wakeup_prepare();
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP
  int64_t ext1_mask;
  esp_pm_ext1_wakeup_prepare();
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP
  esp_pm_gpio_wakeup_prepare();
#endif
#ifdef CONFIG_PM_ULP_WAKEUP
  esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_PERIPH, ESP_PD_OPTION_ON);
  esp_sleep_enable_ulp_wakeup();
#endif
#ifdef CONFIG_PM_UART_WAKEUP
  esp_pm_uart_wakeup_prepare();
#endif /* CONFIG_PM_UART_WAKEUP */

  esp_pm_sleep_enable_timer_wakeup(time_in_us);

