sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pm.c
  esp_pm_light_sleep_start(&rtc_diff_us);

#ifdef CONFIG_SCHED_TICKLESS
  up_step_idletime((uint32_t)time_in_us);
#endif

  cause = esp_sleep_get_wakeup_cause();
  pwrinfo("Returned from light-sleep with: %s, slept for %" PRIu32 " ms\n",
          g_wakeup_reasons[cause],
          (uint32_t)(rtc_diff_us) / 1000);

#ifdef CONFIG_PM_EXT1_WAKEUP
  if (cause == ESP_SLEEP_WAKEUP_EXT1)
    {
      ext1_mask = esp_sleep_get_ext1_wakeup_status();
      pwrinfo("EXT1 wakeup mask: %" PRIu64 "\n", ext1_mask);
    }
#endif

#if defined(CONFIG_PM_GPIO_WAKEUP) && \
    defined(SOC_GPIO_SUPPORT_HP_PERIPH_PD_SLEEP_WAKEUP)
  if (cause == ESP_SLEEP_WAKEUP_GPIO)
    {
      gpio_mask = esp_sleep_get_gpio_wakeup_status();
      pwrinfo("GPIO wakeup mask: %" PRIu64 "\n", gpio_mask);
    }
#endif
}

/****************************************************************************
 * Name: esp_pmsleep
 *
 * Description:
 *   Enter pm sleep (deep sleep) mode.
 *
 * Input Parameters:
 *   time_in_us - The maximum time to sleep in microseconds.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp_pmsleep(uint64_t time_in_us)
{
#ifdef CONFIG_PM_EXT1_WAKEUP
  esp_pm_ext1_wakeup_prepare();
#endif
#ifdef CONFIG_PM_ULP_WAKEUP
  esp_sleep_enable_ulp_wakeup();
#endif
  esp_pm_sleep_enable_timer_wakeup(time_in_us);
  esp_pm_deep_sleep_start();
}

/****************************************************************************
 * Name: esp_pmconfigure
 *
 * Description:
 *   Configure power manager.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Returns OK on success; a negated errno value on failure.
 *
 ****************************************************************************/

int esp_pmconfigure(void)
{
  int ret;
  esp_err_t err = ESP_OK;
#ifdef CONFIG_PM_EXT1_WAKEUP
  int64_t ext1_mask;
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP
  int64_t gpio_mask;
#endif
  esp_pm_config_t pm_config =
    {
      .max_freq_mhz = CONFIG_ESPRESSIF_CPU_FREQ_MHZ,
#ifdef CONFIG_ESPRESSIF_DFS
      .min_freq_mhz = CONFIG_ESPRESSIF_MIN_CPU_FREQ_MHZ,
#else
      .min_freq_mhz = CONFIG_ESPRESSIF_CPU_FREQ_MHZ,
#endif
#ifdef CONFIG_ESPRESSIF_AUTO_SLEEP
      .light_sleep_enable = true
#endif
    };

  ret = esp_pm_configure(&pm_config);
  if (ret != OK)
    {
      return ret;
    }

#ifdef CONFIG_PM_EXT0_WAKEUP
  esp_pm_ext0_wakeup_prepare();
#endif
#ifdef CONFIG_PM_EXT1_WAKEUP
  esp_pm_ext1_wakeup_prepare();
#endif
#ifdef CONFIG_PM_GPIO_WAKEUP
  esp_pm_gpio_wakeup_prepare();
#endif
#ifdef CONFIG_PM_UART_WAKEUP
#  ifdef SOC_UART_SUPPORT_XTAL_CLK
  esp_sleep_pd_config(ESP_PD_DOMAIN_XTAL, ESP_PD_OPTION_ON);
#  endif
  esp_pm_uart_wakeup_prepare();
#endif /* CONFIG_PM_UART_WAKEUP */

#ifdef CONFIG_ESPRESSIF_AUTO_SLEEP
  err = esp_pm_register_skip_light_sleep_callback(
          esp_pm_skip_light_sleep);
  if (err != ESP_OK)
    {
      pwrerr("Failed to register skip light sleep callback: %d\n", err);
      return -ENOMEM;
    }

  esp_pm_sleep_cbs_register_config_t sleep_cbs =
    {
      .enter_cb = NULL,
      .exit_cb = esp_pm_light_sleep_exit_cb,
      .enter_cb_user_arg = NULL,
      .exit_cb_user_arg = NULL,
      .enter_cb_prior = 0,
      .exit_cb_prior = 0,
    };

  err = esp_pm_light_sleep_register_cbs(&sleep_cbs);
  if (err != ESP_OK)
    {
      pwrerr("Failed to register light sleep callbacks: %d\n", err);
      return -ENOMEM;
    }

  err =
    esp_sleep_set_console_uart_handling_mode(ESP_SLEEP_ALWAYS_FLUSH_UART);
  if (err != ESP_OK)
    {
      pwrerr("Failed to set console UART handling mode: %d\n", err);
      return -ENOMEM;
    }
#endif

  return ret;
}
